geosmall/Arduino_Core_STM32/cores/arduino/stm32/uart.c
  /* Must disable interrupt to prevent handle lock contention */
  HAL_NVIC_DisableIRQ(obj->irq);

  HAL_UART_Receive_IT(uart_handlers[obj->index], &(obj->recv), 1);

  /* Enable interrupt */
  HAL_NVIC_EnableIRQ(obj->irq);
}

/**
 * Begin asynchronous TX transfer.
 *
 * @param obj : pointer to serial_t structure
 * @param callback : function call at the end of transmission
 * @retval none
 */
void uart_attach_tx_callback(serial_t *obj, int (*callback)(serial_t *), size_t size)
{
  if (obj == NULL) {
    return;
  }
  obj->tx_callback = callback;

  /* Must disable interrupt to prevent handle lock contention */
  HAL_NVIC_DisableIRQ(obj->irq);

  /* The following function will enable UART_IT_TXE and error interrupts */
  HAL_UART_Transmit_IT(uart_handlers[obj->index], &obj->tx_buff[obj->tx_tail], size);

  /* Enable interrupt */
  HAL_NVIC_EnableIRQ(obj->irq);
}

/**
 * Enable transmitter for half-duplex mode. NOOP in full-fuplex mode
 *
 * @param obj : pointer to serial_t structure
 * @retval none
 */
void uart_enable_tx(serial_t *obj)
{
  if (obj != NULL && obj->pin_rx == NC) {
    HAL_HalfDuplex_EnableTransmitter(uart_handlers[obj->index]);
  }
}

/**
 * Enable receiver for half-duplex mode. NOOP in full-fuplex mode
 *
 * @param obj : pointer to serial_t structure
 * @retval none
 */
void uart_enable_rx(serial_t *obj)
{
  if (obj != NULL && obj->pin_rx == NC) {
    HAL_HalfDuplex_EnableReceiver(uart_handlers[obj->index]);
  }
}

#if defined(HAL_DMA_MODULE_ENABLED)
/*
 * DMA Listen Mode Implementation
 * Pattern: Circular DMA + IDLE line detection (UVOS/Betaflight style)
 *
 * DMA runs continuously in circular mode, filling buffer.
 * IDLE line interrupt fires when line goes idle (gap between packets).
 * TC (Transfer Complete) and HT (Half Transfer) also trigger data processing.
 * CPU reads from tail, DMA writes at head - no conflicts.
 */

/* Forward declarations */
static IRQn_Type uart_dma_get_rx_irqn(serial_t *obj);
static void uart_dma_check_rx(serial_t *obj);

/**
 * @brief  Get current DMA head position (where DMA is writing)
 * @param  obj : pointer to serial_t structure
 * @retval Current position in DMA buffer
 */
static inline size_t uart_dma_get_head(serial_t *obj)
{
  return obj->dma_rx_size - __HAL_DMA_GET_COUNTER(&obj->hdma_rx);
}

/**
 * @brief  Check for new DMA data and invoke callback
 *         Handles wraparound when buffer wraps from end to beginning
 * @param  obj : pointer to serial_t structure
 */
static void uart_dma_check_rx(serial_t *obj)
{
  if (!obj->dma_listen_mode || !obj->dma_rx_callback) {
    return;
  }

  size_t pos = uart_dma_get_head(obj);
  size_t old_pos = obj->dma_rx_last_pos;

  if (pos == old_pos) {
    return; /* No new data */
  }

#if defined(STM32H7xx)
  /* H7: Invalidate D-Cache before reading DMA buffer */
  if (pos > old_pos) {
    SCB_InvalidateDCache_by_Addr((uint32_t *)&obj->dma_rx_buf[old_pos],
                                  pos - old_pos);
  } else {
    /* Wraparound: invalidate from old_pos to end, then from 0 to pos */
    SCB_InvalidateDCache_by_Addr((uint32_t *)&obj->dma_rx_buf[old_pos],
                                  obj->dma_rx_size - old_pos);
    if (pos > 0) {
      SCB_InvalidateDCache_by_Addr((uint32_t *)&obj->dma_rx_buf[0], pos);
    }
  }
#endif

  if (pos > old_pos) {
    /* Linear case: data from old_pos to pos */
    obj->dma_rx_callback(obj, &obj->dma_rx_buf[old_pos], pos - old_pos);
  } else {
    /* Wraparound: data from old_pos to end, then from 0 to pos */
    obj->dma_rx_callback(obj, &obj->dma_rx_buf[old_pos],
                         obj->dma_rx_size - old_pos);
    if (pos > 0) {
      obj->dma_rx_callback(obj, &obj->dma_rx_buf[0], pos);
    }
  }

  /* Update last processed position */
  obj->dma_rx_last_pos = pos;
  if (obj->dma_rx_last_pos >= obj->dma_rx_size) {
    obj->dma_rx_last_pos = 0;
  }
}

/**
 * @brief  Start DMA-based circular RX with IDLE line detection
 * @param  obj : pointer to serial_t structure
 * @param  buf : user-provided DMA buffer
 * @param  size : size of the DMA buffer
 * @param  callback : function called when new data arrives
 * @retval 0 on success, -1 on error
 */
int uart_dma_listen_start(serial_t *obj, uint8_t *buf, size_t size,
                          uart_dma_rx_callback_t callback)
{
  if (obj == NULL || buf == NULL || size == 0) {
    return -1;  /* Invalid parameters */
  }

  UART_HandleTypeDef *huart = uart_handlers[obj->index];
  if (huart == NULL) {
    return -2;  /* UART handler not initialized */
  }

#if defined(STM32H7xx)
  /* H7: Validate buffer is in non-cached D2 SRAM3 region (0x30040000-0x30047FFF)
   * Buffers must use SERIAL_DMA_BUFFER attribute for DMA coherency.
   * This matches the MPU configuration done for Wire DMA in hw_config.c */
  uint32_t buf_addr = (uint32_t)buf;
  if (buf_addr < 0x30040000 || buf_addr >= 0x30048000) {
    return -8;  /* Buffer not in DMA-safe D2 SRAM3 region */
  }
#endif

  /* Store DMA configuration */
  obj->dma_rx_buf = buf;
  obj->dma_rx_size = size;
  obj->dma_rx_callback = callback;
  obj->dma_rx_last_pos = 0;

  /* Configure DMA for circular RX */
  obj->hdma_rx.Instance = NULL; /* Will be set based on UART peripheral */

  /* DMA Stream/Channel mapping for STM32F4xx */
#if defined(STM32F4xx)
  switch ((uint32_t)obj->uart) {
#if defined(USART1_BASE)
    case USART1_BASE:
      __HAL_RCC_DMA2_CLK_ENABLE();
      obj->hdma_rx.Instance = DMA2_Stream2;
      obj->hdma_rx.Init.Channel = DMA_CHANNEL_4;
      break;
#endif
#if defined(USART2_BASE)
    case USART2_BASE:
      __HAL_RCC_DMA1_CLK_ENABLE();
      obj->hdma_rx.Instance = DMA1_Stream5;
      obj->hdma_rx.Init.Channel = DMA_CHANNEL_4;
      break;
#endif
#if defined(USART6_BASE)
    case USART6_BASE:
      __HAL_RCC_DMA2_CLK_ENABLE();
      obj->hdma_rx.Instance = DMA2_Stream1;
      obj->hdma_rx.Init.Channel = DMA_CHANNEL_5;
      break;
#endif
    default:
      return -3; /* Unsupported UART for DMA */
  }
#elif defined(STM32H7xx)
  /* H7 uses DMAMUX, so any DMA stream can be used */
  __HAL_RCC_DMA1_CLK_ENABLE();
  obj->hdma_rx.Instance = DMA1_Stream5;

