geosmall/Arduino_Core_STM32/cores/arduino/stm32/uart.c
  /* Set DMAMUX request based on UART peripheral */
  switch ((uint32_t)obj->uart) {
#if defined(USART1_BASE)
    case USART1_BASE:
      obj->hdma_rx.Init.Request = DMA_REQUEST_USART1_RX;
      break;
#endif
#if defined(USART2_BASE)
    case USART2_BASE:
      obj->hdma_rx.Init.Request = DMA_REQUEST_USART2_RX;
      break;
#endif
#if defined(USART3_BASE)
    case USART3_BASE:
      obj->hdma_rx.Init.Request = DMA_REQUEST_USART3_RX;
      break;
#endif
#if defined(UART4_BASE)
    case UART4_BASE:
      obj->hdma_rx.Init.Request = DMA_REQUEST_UART4_RX;
      break;
#endif
#if defined(USART6_BASE)
    case USART6_BASE:
      obj->hdma_rx.Init.Request = DMA_REQUEST_USART6_RX;
      break;
#endif
    default:
      return -3;  /* Unsupported UART for DMA */
  }
#else
  /* Other STM32 families - add as needed */
  return -4;  /* Unsupported STM32 family */
#endif

  if (obj->hdma_rx.Instance == NULL) {
    return -5;  /* DMA instance not set */
  }

  /* Common DMA configuration for circular RX */
  obj->hdma_rx.Init.Direction = DMA_PERIPH_TO_MEMORY;
  obj->hdma_rx.Init.PeriphInc = DMA_PINC_DISABLE;
  obj->hdma_rx.Init.MemInc = DMA_MINC_ENABLE;
  obj->hdma_rx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
  obj->hdma_rx.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
  obj->hdma_rx.Init.Mode = DMA_CIRCULAR;
  obj->hdma_rx.Init.Priority = DMA_PRIORITY_HIGH;
#if defined(STM32F4xx)
  obj->hdma_rx.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
#endif

  if (HAL_DMA_Init(&obj->hdma_rx) != HAL_OK) {
    return -6;  /* HAL_DMA_Init failed */
  }

  /* Link DMA to UART */
  __HAL_LINKDMA(huart, hdmarx, obj->hdma_rx);

  /* Abort any pending RX operation (IT mode) before starting DMA */
  /* This is required because begin() starts IT-based receive */
  if (huart->RxState != HAL_UART_STATE_READY) {
    HAL_UART_AbortReceive(huart);
  }

  /* Enable IDLE line interrupt */
  __HAL_UART_ENABLE_IT(huart, UART_IT_IDLE);

  /* Enable DMA stream interrupts */
  HAL_NVIC_SetPriority(uart_dma_get_rx_irqn(obj), UART_IRQ_PRIO, UART_IRQ_SUBPRIO);
  HAL_NVIC_EnableIRQ(uart_dma_get_rx_irqn(obj));

  /* Set listen mode flag before starting DMA */
  obj->dma_listen_mode = 1;

#if defined(STM32H7xx)
  /* H7: Invalidate cache for buffer before DMA starts */
  SCB_InvalidateDCache_by_Addr((uint32_t *)buf, size);
#endif

  /* Start DMA reception */
  if (HAL_UART_Receive_DMA(huart, buf, size) != HAL_OK) {
    obj->dma_listen_mode = 0;
    return -7;  /* HAL_UART_Receive_DMA failed */
  }

  return 0;
}

/**
 * @brief  Get DMA RX stream IRQn based on UART peripheral
 * @param  obj : pointer to serial_t structure
 * @retval IRQn_Type for the DMA stream
 */
static IRQn_Type uart_dma_get_rx_irqn(serial_t *obj)
{
#if defined(STM32F4xx)
  switch ((uint32_t)obj->uart) {
#if defined(USART1_BASE)
    case USART1_BASE:
      return DMA2_Stream2_IRQn;
#endif
#if defined(USART2_BASE)
    case USART2_BASE:
      return DMA1_Stream5_IRQn;
#endif
#if defined(USART6_BASE)
    case USART6_BASE:
      return DMA2_Stream1_IRQn;
#endif
    default:
      return (IRQn_Type)0;
  }
#elif defined(STM32H7xx)
  return DMA1_Stream5_IRQn;
#else
  return (IRQn_Type)0;
#endif
}

/**
 * @brief  Stop DMA listening mode
 * @param  obj : pointer to serial_t structure
 */
void uart_dma_listen_stop(serial_t *obj)
{
  if (obj == NULL || !obj->dma_listen_mode) {
    return;
  }

  UART_HandleTypeDef *huart = uart_handlers[obj->index];
  if (huart == NULL) {
    return;
  }

  /* Clear listen mode flag */
  obj->dma_listen_mode = 0;

  /* Disable IDLE interrupt */
  __HAL_UART_DISABLE_IT(huart, UART_IT_IDLE);

  /* Stop DMA */
  HAL_UART_DMAStop(huart);

  /* Disable DMA stream interrupt */
  HAL_NVIC_DisableIRQ(uart_dma_get_rx_irqn(obj));
}

/**
 * @brief  Check if DMA listen mode is active
 * @param  obj : pointer to serial_t structure
 * @retval 1 if listening, 0 otherwise
 */
uint8_t uart_dma_is_listening(serial_t *obj)
{
  if (obj == NULL) {
    return 0;
  }
  return obj->dma_listen_mode;
}
#endif /* HAL_DMA_MODULE_ENABLED */

/**
  * @brief  Return index of the serial handler
  * @param  UartHandle pointer on the uart reference
  * @retval index
  */
/*
uint8_t uart_index(UART_HandleTypeDef *huart)
{
  uint8_t i = 0;
  if (huart == NULL) {
    return UART_NUM;
  }

  for (i = 0; i < UART_NUM; i++) {
    if (huart == uart_handlers[i]) {
      break;
    }
  }

  return i;
}
*/

/**
  * @brief  Rx Transfer completed callback
  * @param  UartHandle pointer on the uart reference
  * @retval None
  */
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
  serial_t *obj = get_serial_obj(huart);
  if (obj == NULL) {
    return;
  }

#if defined(HAL_DMA_MODULE_ENABLED)
  /* In DMA listen mode, TC callback means buffer wrapped around */
  if (obj->dma_listen_mode) {
    uart_dma_check_rx(obj);
    return;
  }
#endif

  if (obj->rx_callback) {
    obj->rx_callback(obj);
  }
}

/**
  * @brief  Tx Transfer completed callback
  * @param  UartHandle pointer on the uart reference
  * @retval None
  */
void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)
{
  serial_t *obj = get_serial_obj(huart);
  if (obj && obj->tx_callback) {
    obj->tx_callback(obj);
  }
}

#if defined(HAL_DMA_MODULE_ENABLED)
/**
  * @brief  Rx Half Transfer callback (for circular DMA mode)
  * @param  UartHandle pointer on the uart reference
  * @retval None
  */
void HAL_UART_RxHalfCpltCallback(UART_HandleTypeDef *huart)
{
  serial_t *obj = get_serial_obj(huart);
  if (obj && obj->dma_listen_mode) {
    uart_dma_check_rx(obj);
  }
}
#endif /* HAL_DMA_MODULE_ENABLED */

/**
  * @brief  error callback from UART
  * @param  UartHandle pointer on the uart reference
  * @retval None
  */
void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart)
{
  serial_t *obj = get_serial_obj(huart);

#if defined(STM32F1xx) || defined(STM32F2xx) || defined(STM32F4xx) || defined(STM32L1xx)
  if (__HAL_UART_GET_FLAG(huart, UART_FLAG_PE) != RESET) {
    __HAL_UART_CLEAR_PEFLAG(huart); /* Clear PE flag */
  } else if (__HAL_UART_GET_FLAG(huart, UART_FLAG_FE) != RESET) {
    __HAL_UART_CLEAR_FEFLAG(huart); /* Clear FE flag */
  } else if (__HAL_UART_GET_FLAG(huart, UART_FLAG_NE) != RESET) {
    __HAL_UART_CLEAR_NEFLAG(huart); /* Clear NE flag */
  } else if (__HAL_UART_GET_FLAG(huart, UART_FLAG_ORE) != RESET) {
    __HAL_UART_CLEAR_OREFLAG(huart); /* Clear ORE flag */
  }
#else
  if (__HAL_UART_GET_FLAG(huart, UART_FLAG_PE) != RESET) {
    __HAL_UART_CLEAR_FLAG(huart, UART_CLEAR_PEF); /* Clear PE flag */
  } else if (__HAL_UART_GET_FLAG(huart, UART_FLAG_FE) != RESET) {
    __HAL_UART_CLEAR_FLAG(huart, UART_CLEAR_FEF); /* Clear FE flag */
  } else if (__HAL_UART_GET_FLAG(huart, UART_FLAG_NE) != RESET) {
    __HAL_UART_CLEAR_FLAG(huart, UART_CLEAR_NEF); /* Clear NE flag */
  } else if (__HAL_UART_GET_FLAG(huart, UART_FLAG_ORE) != RESET) {
    __HAL_UART_CLEAR_FLAG(huart, UART_CLEAR_OREF); /* Clear ORE flag */
  }
#endif

#if defined(HAL_DMA_MODULE_ENABLED)
  /* In DMA listen mode, restart DMA reception after error */
  if (obj && obj->dma_listen_mode) {
    /* Disable IDLE IRQ */
    __HAL_UART_DISABLE_IT(huart, UART_IT_IDLE);
    /* Stop DMA */
    HAL_UART_DMAStop(huart);

#if defined(STM32H7xx)
    /* H7: Re-invalidate cache for buffer */
    SCB_InvalidateDCache_by_Addr((uint32_t *)obj->dma_rx_buf, obj->dma_rx_size);
#endif

    /* Re-enable IDLE IRQ */
    __HAL_UART_ENABLE_IT(huart, UART_IT_IDLE);
    /* Restart DMA reception */
    HAL_UART_Receive_DMA(huart, obj->dma_rx_buf, obj->dma_rx_size);
    return;
  }
#endif

  /* Restart receive interrupt after any error (normal mode) */
  if (obj && !serial_rx_active(obj)) {
    HAL_UART_Receive_IT(huart, &(obj->recv), 1);
  }
}

#if defined(HAL_DMA_MODULE_ENABLED)
/**
  * @brief  Helper to check for IDLE line interrupt in DMA listen mode
  * @param  index : UART index
  */
static inline void uart_dma_check_idle(uart_index_t index)
{
  if (uart_handlers[index] == NULL) {
    return;
  }

  serial_t *obj = get_serial_obj(uart_handlers[index]);
  if (obj == NULL || !obj->dma_listen_mode) {
    return;
  }

